<!-- dflook/terraform-github-actions {"workspace":"diff","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"e471c1a1b65db59bee545d2c9d639af455013e45c594d94d0ec4a85fdde3eb55","plan_job_ref":"Job Test plan target and replace #381 at https://github.com/dflook/terraform-github-actions/actions/runs/7264551037","plan_hash":"b6b924544c15000fff81cb36bcd92ae0b7867de4caa04bebc8cae11df82af6fb","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __diff__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "eoELLfRAXy" -> (known after apply)
!~  foreach = "zqffVvfwLM" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #381](https://github.com/dflook/terraform-github-actions/actions/runs/7264551037)